# SQL 
# Name: Habtom Woldu
# Date 06-08-2023

Task four: SQL 
Connecting to the Database in Python

In [110]:
import sqlite3

In [111]:
connection = sqlite3.connect(r'C:\Users\15734\Downloads\books (3).db')

Viewing the Author's Table Contents
SQL query and pandas to view the authors table contents:

In [112]:
import pandas as pd

In [113]:
pd.options.display.max_columns = 10

In [114]:
pd.read_sql('SELECT * FROM authors', connection,
            index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald

Use of SQL & Pandas to view the title of table's contents:

In [115]:
pd.read_sql('SELECT * FROM titles',  connection)

         isbn                             title  edition copyright
0  0135404673     Intro to Python for CS and DS        1      2020
1  0132151006     Internet & WWW How to Program        5      2012
2  0134743350               Java How to Program       11      2018
3  0133976890                  C How to Program        8      2016
4  0133406954  Visual Basic 2012 How to Program        6      2014
5  0134601548          Visual C# How to Program        6      2017
6  0136151574         Visual C++ How to Program        2      2008
7  0134448235                C++ How to Program       10      2017
8  0134444302            Android How to Program        3      2017
9  0134289366         Android 6 for Programmers        3      2016

In [117]:
df = pd.read_sql('SELECT * FROM author_ISBN', connection)

In [118]:
df.head()

   id        isbn
0   1  0134289366
1   2  0134289366
2   5  0134289366
3   1  0135404673
4   2  0135404673

Section 1. 
Complete 17.2.2 SELECT QUeries (1 query)

In [119]:
pd.read_sql('SELECT first,last FROM authors', connection)

       first    last
0       Paul  Deitel
1     Harvey  Deitel
2      Abbey  Deitel
3        Dan   Quirk
4  Alexander    Wald

Section 2: WHERE CLAUSE . Complete 17.2.3 WHERE (3 queries)
Selection of rows in a database that satisfy certain selection criteria
*query 1: Select the title, edition and copyright of all books*

In [120]:
pd.read_sql("""SELECT title, edition,copyright FROM titles WHERE copyright > '2016'""",connection)

                           title  edition copyright
0  Intro to Python for CS and DS        1      2020
1            Java How to Program       11      2018
2       Visual C# How to Program        6      2017
3             C++ How to Program       10      2017
4         Android How to Program        3      2017

*query 2: Pattern Matching Zero or more Characters*
*Locate all authors whose last name starts with the letter D*

In [121]:
pd.read_sql("""SELECT id, first, last 
            FROM authors
            WHERE last LIKE 'D%'""",
           connection,index_col=['id'] )

     first    last
id
1     Paul  Deitel
2   Harvey  Deitel
3    Abbey  Deitel

Any Character Select rows 
*query 3: Pattern Matching: Any character*

In [122]:
pd.read_sql("""SELECT id, first, last 
            FROM authors
            WHERE first LIKE '_b%'""",
           connection,index_col=['id'])

    first    last
id
3   Abbey  Deitel

Section 3: ORDER BY.  (4 queries)
*query 1 Order By Clause sort in ascending order*

In [123]:
pd.read_sql('SELECT title FROM titles ORDER BY title ASC', connection)

                              title
0         Android 6 for Programmers
1            Android How to Program
2                  C How to Program
3                C++ How to Program
4     Internet & WWW How to Program
5     Intro to Python for CS and DS
6               Java How to Program
7  Visual Basic 2012 How to Program
8          Visual C# How to Program
9         Visual C++ How to Program

Sorting by Muliple Columns
*query 2: sorting the author's name by last name ,then by first name for any authors who have the same last name*

In [124]:
pd.read_sql("""SELECT id, first, last 
            FROM authors
            ORDER BY last, first""",
           connection,index_col=['id'])

        first    last
id
3       Abbey  Deitel
2      Harvey  Deitel
1        Paul  Deitel
4         Dan   Quirk
5   Alexander    Wald

*query 3 : Sorting authors in descending order by last name and ascending order by first name for any authors who have the same last name*

In [125]:
pd.read_sql("""SELECT id, first, last 
            FROM authors
            ORDER BY last DESC, first ASC """,
           connection,index_col=['id'])

        first    last
id
5   Alexander    Wald
4         Dan   Quirk
3       Abbey  Deitel
2      Harvey  Deitel
1        Paul  Deitel

Combining the WHERE and ORDER BY Clauses 
*query 4 : Get the isbn,title, edition andcopyright of each book in titles table*

In [126]:
pd.read_sql("""SELECT isbn, title, edition, copyright
               FROM titles
               WHERE title LIKE '%How to Program'
               ORDER BY title""", connection)

         isbn                             title  edition copyright
0  0134444302            Android How to Program        3      2017
1  0133976890                  C How to Program        8      2016
2  0134448235                C++ How to Program       10      2017
3  0132151006     Internet & WWW How to Program        5      2012
4  0134743350               Java How to Program       11      2018
5  0133406954  Visual Basic 2012 How to Program        6      2014
6  0134601548          Visual C# How to Program        6      2017
7  0136151574         Visual C++ How to Program        2      2008

Merging Data From Multiple Tables 
Section 4: INNER JOIN
*query 1. A list of authors accompanied by the ISBNs for books written by each auhtor*

In [127]:
pd.read_sql("""SELECT first, last, isbn 
            FROM authors 
            INNER JOIN author_ISBN 
                ON authors.id = author_ISBN.id 
            ORDER BY last, first""", connection).head()

    first    last        isbn
0   Abbey  Deitel  0132151006
1   Abbey  Deitel  0133406954
2  Harvey  Deitel  0134289366
3  Harvey  Deitel  0135404673
4  Harvey  Deitel  0132151006

Section 5: INSERT INTO Statement 
Sometimes you will execute SQL statements that *modify* the database. 
To do so use sqlite3 cursor object
The INSERT INTO statement insert a row into a table
*query 1. lets insert a new author names Sue RED into the authors table*

In [128]:
cursor = connection.cursor()

In [129]:
cursor.execute("""INSERT INTO authors (first, last) VALUES ('Sue', 'Red')""")

In [130]:
pd.read_sql('SELECT id, first, last  FROM authors',
            connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
6         Sue     Red

Section 6: UPDATE
An UPDATE statement modifies existing values.
*query 1: SUe Red last name is incorrect in the db and update to 'Black'*

In [131]:
cursor = cursor.execute(
    """UPDATE authors SET last='Black' WHERE last='Red' AND first='Sue'""")

In [57]:
pd.read_sql('SELECT id, first, last FROM authors',
            connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald

In [132]:
cursor.rowcount

1

In [133]:
pd.read_sql('SELECT id, first, last FROM authors',
            connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
6         Sue   Black

*query 2: Confirm the update by listing the authors table's contents*

In [134]:
cursor.rowcount

1

In [135]:
pd.read_sql('SELECT id, first, last FROM authors',
            connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
6         Sue   Black

Section 7: DELETE FROM
SQL DELETE FROM statement removes rows from table
*query 1: Delete Sue Black*

In [136]:
cursor = cursor.execute('DELETE FROM authors WHERE id=6')

In [137]:
pd.read_sql('SELECT id, first, last FROM authors',
            connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald

Section 8 : SELECT 
Query 1 From author table

In [138]:
import pandas as pd

In [139]:
pd.options.display.max_columns = 10

In [140]:
pd.read_sql('SELECT * FROM authors', connection,
            index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald

query 2 From Titles Table

In [141]:
pd.read_sql('SELECT * FROM titles',  connection)

         isbn                             title  edition copyright
0  0135404673     Intro to Python for CS and DS        1      2020
1  0132151006     Internet & WWW How to Program        5      2012
2  0134743350               Java How to Program       11      2018
3  0133976890                  C How to Program        8      2016
4  0133406954  Visual Basic 2012 How to Program        6      2014
5  0134601548          Visual C# How to Program        6      2017
6  0136151574         Visual C++ How to Program        2      2008
7  0134448235                C++ How to Program       10      2017
8  0134444302            Android How to Program        3      2017
9  0134289366         Android 6 for Programmers        3      2016

query 3 From author_ISBN Table

In [21]:
df = pd.read_sql('SELECT * FROM author_ISBN', connection)

In [142]:
df.head()

   id        isbn
0   1  0134289366
1   2  0134289366
2   5  0134289366
3   1  0135404673
4   2  0135404673